/* Errors returned by the device in the form of xml */
"Success" = "Успешно";
"TestInProgress" = "Выполняется проверка, подождите...";
"ErrorDeviceBusy" = "Устройство занято. Повторите попытку позже.";
"ErrorDuplicateDisplayName" = "Такое имя уже существует. Укажите другое имя и повторите попытку.";
"ErrorEmptyEntry" = "Одна из записей в отправленных на устройство параметрах пуста. Проверьте все записи и повторите попытку.";
"ErrorListFull" = "Недостаточно места для добавления этой записи. Удалите запись из устройства и повторите попытку.";
"ErrorSettingNotTested" = "Этот параметр не был проверен.";
"ErrorSystemFailure" = "Произошла критическая ошибка. Повторите попытку позже.";
"ErrorNoMoreSpace" = "Максимальный размер вложения слишком большой для выбранного сервера. Введите меньшее значение и повторите попытку.";
"ErrorNoWritePermission" = "Отсутствуют права на запись в выбранную папку. Установите соответствующие права доступа к этой папке и повторите попытку.";
"ErrorConnectionFailed" = "Устройство не может подключиться к указанному удаленному серверу. Проверьте параметры сервера.";
"ErrorConnectionRefused" = "Сервер отклонил подключение. Убедитесь, что сервер включен и работает.";
"ErrorServerNotFound" = "Устройство не может сопоставить имя сервера. Проверьте параметры сервера.";
"ErrorWrongCredentials" = "Сервер отклонил учетные данные пользователя, используемые для проверки подлинности. Введите правильные учетные данные и повторите попытку.";
"ErrorConnectionProblem" = "Возникла проблема при подключении к удаленному серверу. Убедитесь, что сервер подключен к сети и работает.";
"ErrorProtocolNotSupported" = "Удаленный сервер использует протокол, который не поддерживается.";
"ErrorInvalidFileOrDirectory" = "Недопустимое расположение. Укажите правильное расположение и повторите попытку.";
"ErrorInvalidFolderPath" = "Недопустимое расположение. Укажите правильное расположение и повторите попытку.";
"ErrorInvalidShare" = "Недопустимая общая папка. Выберите другую общую папку и повторите попытку.";
"ErrorAuthenticationNeeded" = "Для доступа к указанному серверу требуется проверка подлинности. Введите правильные учетные данные и повторите попытку.";
"ErrorSecureConnectionNotSupported" = "Сервер не поддерживает безопасное подключение. Отключите использование протокола SSL и повторите попытку.";
"ErrorSenderInvalid" = "Недопустимый адрес эл. почты отправителя. Введите правильный адрес отправителя и повторите попытку.";
"ErrorRecipientInvalid" = "Недопустимый адрес эл. почты получателя. Введите правильный адрес получателя и повторите попытку.";
"ErrorServerError" = "Сервер возвратил ошибку. Запрошенная операция не может быть завершена. Убедитесь, что указаны правильные данные сервера.";
"ErrorInvalidServerName" = "Указан недопустимый сервер. Введите правильный сервер SMTP и повторите попытку.";

"404 Not Found" = "Не удалось найти устройство. Убедитесь, что устройство подключено к сети и включено.";
"400 Bad Request" = "Запрос содержит ошибку. Не удалось выполнить запрос. Повторите попытку позже.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "Устройство не возвратило допустимый адрес URL. Подождите несколько минут и повторите попытку.";

/* XML Data validation errors */
"Setting Error" = "Ошибка: отсутствуют или недопустимые данные";
"MISSING_FOLDER_SETTING" = "Отсутствуют некоторые сведения о конечной папке. Выберите папку, введите имя пользователя и пароль, затем повторите попытку.";
"MISSING_EMAIL_SETTING" = "Отсутствуют некоторые сведения о получателе эл. почты. Введите все параметры эл. почты и повторите попытку.";
"MISSING_SERVER_CREDENTIALS" = "Отсутствуют учетные данные сервера. Введите имя пользователя и пароль, а затем повторите попытку.";
"MISSING_DISPLAY_NAME" = "Отсутствует имя отправителя. Введите имя отправителя и повторите попытку.";
"MISSING_EMAIL_ADDRESS" = "Отсутствует адрес эл. почты. Введите допустимый адрес эл. почты и повторите попытку.";
"MISSING_SERVER" = "Отсутствует сервер. Введите сервер и повторите попытку.";

"INVALID_PIN" = "Указан недопустимый персональный идентификационный номер (PIN-код). Этот номер должен содержать 4 цифры. Введите допустимый PIN-код и повторите попытку.";
"INVALID_SERVER_PORT" = "Указан недопустимый номер порта сервера. Номер порта должен быть от 1 до 65535.";
"INVALID_ATTMT_SIZE" = "Указан недопустимый максимальный размер вложения. Размер должен быть от 1 до 9999. Укажите -1 для использования автоматического значения.";
"INVALID_DFADESTINATION" = "Выбрано недопустимое место назначения цифрового факса. Выберите правильное место назначения.";
"INVALID_POLLING_TIME" = "Выбран недопустимый интервал опроса. Допустимые значения: 5, 10, 15, 20, 30, 45 и 60. Выберите правильный интервал и повторите попытку.";
"INVALID_DISPLAY_NAME" = "Указано недопустимое имя отправителя. Введите имя длиной до 25 символов.";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Ошибка";
"GENERIC_DEVICE_ERROR_TITLE" = "Ошибка устройства";
"GENERIC_DEVICE_ERROR_DESC" = "Неизвестная ошибка при обмене данными с устройством. Повторите попытку позже.";
"XML_PARSING_ERROR" = "Устройство возвратило недопустимые данные. Подождите несколько минут и повторите попытку.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "При обмене данными с устройством произошла ошибка. Убедитесь, что устройство и компьютер подключены к сети, а затем повторите попытку.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Отмена";
"Hide" = "Скрыть";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Устройство не найдено";
"DEVICE_NOT_FOUND_DESC" = "Проблема при обмене данными с устройством. Убедитесь, что устройство включено и правильно подключено, а затем повторите попытку.";

"PML_ERROR_TITLE" = "Ошибка устройства";
"PML_ERROR_DESC1" = "Проблема с настройкой информации на устройстве. Убедитесь, что заданы допустимые значения.";

"SETTING_REJECTED_TITLE" = "Параметры не приняты";

"SETTING_REJECTED_DESCRIPTION" = "Не удалось выполнить настройку, так как устройство защищено паролем администратора. Удалите пароль администратора с помощью встроенного веб-сервера. Дополнительные сведения см. в документации устройства.";
"GENERAL_DATA_MISSING_DESCRIPTION" = "Одно или несколько полей не содержат данные. Заполните все поля или щелкните \"Отмена\".";

//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Крышка открыта";
"DOOR_OPEN_DESC" = "Принтер не может печатать из-за открытой крышки. Закройте все крышки на принтере.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "Принтер находится в состоянии ошибки";
"INCORRECT_STATE_DESC" = "Устраните на устройстве состояние ошибки и повторите попытку.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "Принтер в данный момент занят";
"DEVICE_BUSY_DESC" = "Дождитесь, когда принтер завершит выполнение текущего задания.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "Определение номера не поддерживается";
"CALLER_ID_NOT_SUPPORTED_DESC" = "Выбранная на устройстве страна (регион) не поддерживает определение номера. Выберите с помощью панели управления страну (регион), которая поддерживает определение номера, и повторите попытку.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Не удается применить настройки.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Убедитесь, что устройство подключено к сети и не обрабатывает задачу отправки факса.";

